       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME PIC X(20).

       PROCEDURE DIVISION.
           DISPLAY "HELLO".
           STOP RUN.
