       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYSAMPLE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTCOPY.
       COPY ACCTLAY REPLACING ==:TAG:== BY ==WS-==.

       PROCEDURE DIVISION.
           STOP RUN.
