******************************************************************
       01  SIMPLE-RECORD.
           05  FIELD-1        PIC 9(5).
           05  FIELD-2        PIC X(10).
******************************************************************
